""" Дано ланцюжок кульок через номери їх кольорів, 3 3 2 1 1 1 2 2 3 3.
    Якщо зустрічаються три чи більше кульок одного кольору, то вони видаляються.
    Скільки кульок було видалено?
    Ідея. Почергово відправляємо в стек і перевіряємо, чи на верхівці є три
    однакові елем. Якщо так, то видаляємо їх зі стека і запам'ятовуємо колір.
    Далі перевіряємо, чи наступні елементи у вихідному списку дорівнюють
    видаленим. Якщо так, то видаляємо і їх. 
"""
listColors = input().split()
stack = []
i = 0
# while дає можливість перескочити через кілька позицій
while i < len(listColors):
    stack.append(listColors[i])
    if len(stack) > 2 and stack[-1] == stack[-2] == stack[-3]:
        color = stack[-1]
        stack.pop()
        stack.pop()
        stack.pop()
        # Якщо наступні такого ж кольору, то пропускаємо їх.
        while i < len(listColors) and listColors[i] == color:
            i += 1
    else:
        i += 1
print(len(listColors) - len(stack))
